Tekla.Structures.Drawing.AutoSizeOptions
Options for controlling how the sheet size is
calculated when the SizeDefinitionMode is AutoSize.
Tekla.Structures.Drawing.SizeDefinitionMode
Tekla.Structures.Drawing.LayoutAttributes